{
  "it": {
    "common": {
      "nav_home": "Home",
      "nav_projects": "Progetti",
      "nav_resources": "Risorse per studenti",
      "nav_personal": "Personale",
      "download": "Scarica",
      "open": "Apri",
      "contacts_title": "Contatti",
      "cv_title": "Curriculum Vitae",
      "cv_download" : "Scarica il mio CV",
      "credits": "© 2025 William Colombini. Tutti i contenuti sono protetti dalla legge sul diritto d'autore.",
      "license": "Licenza CC BY-NC-ND 4.0"
    },
    "homepage": {
      "page_title": "Il mio sito personale",
      "welcome_title": "Benvenuto nel mio sito personale",
      "featured_title": "Presentazioni in Evidenza",
      "card_energy": "Presentazione su Energia Solare e Fotovoltaico",
      "card_LM": "Analisi Iperspettrale e Machine Learning in Agricoltura",
      "card_LT": "Analisi Raman degli Inchiostri di Lucio Fontana",
      "card_ml": "Classificazione Dati Radar con Machine Learning",
      "resources_title": "Materiali per studenti",
      "resources_description": "Attualmente le dispense per studenti e le simulazioni si trovano nella precedente versione del sito."
    },
    "projects": {
      "projects_title": "I miei progetti",
      "university_projects": "Progetti universitari",
      "view_presentation": "Scarica presentazione",
      "view_pdf": "Scarica PDF",
      "old_site_view": "Accedi alla precedente versione del sito",
      "thesis_section": "Lavori di Tesi",
      "exams_section": "Progetti d'esame",
      "other_section": "Altri Progetti",
      "school_section": "Presentazioni per la scuola",

      "fake_news_title": "Fake News",
      "fake_news_desc": "Una lezione di cittadinanza sulle Fake News, con un esercizio da proporre alla classe. Lo scopo del progetto è sensibilizzare gli adolescenti all'uso corretto dei media attuali per la raccolta di informazioni e notizie.",

      "color_title" : "Teoria dei Colori",
      "color_desc" : "Una lezione di approfondimento sulla fisica dei colori, con link a simulazioni utili. Lo scopo è cercare di dare un quadro multidisciplinare dove storia, fisica, biologia e arte si incontrano e intersecano per spiegare la realtà.",

      "tdad_title": "Simulazione CCD con Arduino",
      "tdad_desc": "Simulazione dell’acquisizione dati da spettrometro Raman con Arduino, C++ e Bash. Lo scopo del progetto è sviluppare una pipeline per la raccolta, l'organizzazione e l'analisi di dati provenienti da un dispositivo elettronico in tempo reale.",

      "thesis_bachelor_title": "Tesi triennale - Analisi Raman",
      "thesis_bachelor_desc": "Analisi spettroscopica degli inchiostri utilizzati da Lucio Fontana nelle sue opere. Il lavoro è compilativo e lo scopo è mostrare un'applicazione multidisciplinare della fisica attraverso un caso studio particolare.",

      "energy_title": "Energia solare e fotovoltaico",
      "energy_desc": "Un breve approfondimento sullo stato della ricerca e degli impianti fotovoltaici. Il progetto è uno sguardo generale all'argomento utilizzando differenti articoli scientifici come riferimento.",

      "ml_title": "Classificazione radar con ML",
      "ml_desc": "Applicazione di tecniche di analisi dati e di machine learning per la classificazione di segnali radar ionosferici. Il progetto include un confronto statistico tra le performances di approcci differenti in modo da trovare la soluzione più ottimale per la classificazione.",

      "thesis_master_title": "Tesi magistrale - Phasor Hyperspectral",
      "thesis_master_desc": "Analisi con fasori su immagini iperspettrali per identificare malattie nelle piante. Lo scopo del lavoro è provare a proporre una pipeline che va dalla raccolta dati al riconoscimento delle malattie utilizzando IA.",

      "old_site_title": "Il mio vecchio sito personale",
      "old_site_desc": "Altri progetti relativi alla didattica o più personali sono presenti nel vecchio sito, meno professionale."
    },
    "resources": {
      "title": "Materiali didattici",
      "resource1_title": "Risorse per studenti",
      "resource2_title": "Simulazioni per studenti",
      "resource1_desc": "Attualmente non disponibili in questa versione. Puoi però trovarle nella",
      "resources_old_site": "Vecchia versione del sito"
    },
    "personal": {
      "page_title": "Personale | Will",
      "title": "Chi sono",
      "bio_title_ed": "Percorso di Studi",
      "bio_title_now": "Attualmente",
      "bio_title_myself": "In generale",
      "bio_text": "Sono un docente di matematica e fisica, appassionato di programmazione, fotografia e divulgazione scientifica.",
      "bio_education" : "Ho conseguito la laurea magistrale in Fisica della Materia presso l’Università degli Studi di Milano-Bicocca. Durante il mio percorso accademico, ho approfondito le applicazioni della fisica in ambiti interdisciplinari, dall’energia all’arte. Ho inoltre acquisito competenze di base nell’analisi dei dati, nel machine learning e nella simulazione numerica.",
      "bio_now" : "Attualmente insegno Matematica e Fisica presso il Liceo Ginnasio Statale B. Cairoli di Vigevano. Questo ruolo mi ha permesso di sviluppare competenze nella comunicazione, nella collaborazione e nell’organizzazione del lavoro in classe.",
      "bio_myself" : "Sono motivato dall’apprendimento continuo e interessato ai settori EdTech, energia e gestione dati.  Sono disponibile per opportunità sia a livello nazionale che internazionale."

    }
  },
  "en": {
    "common": {
      "nav_home": "Homepage",
      "nav_projects": "Projects",
      "nav_resources": "Student Resources",
      "nav_personal": "Personal",
      "download": "Download",
      "open": "Open",
      "contacts_title": "Contacts",
      "cv_title": "Curriculum Vitae",
      "cv_download" : "Download my CV",
      "credits": "© 2025 William Colombini.  All documents and content on this site are protected by intellectual property law.",
      "license": "Licensed under CC BY-NC-ND 4.0"
    },
    "homepage": {
      "page_title": "My Personal Website",
      "welcome_title": "Welcome to my personal website",
      "featured_title": "Featured Presentations",
      "card_energy" : "Solar and Photovoltaic Energy Presentation",
      "card_LM" : "Hyperspectral Analysis and Machine Learning in Agriculture",
      "card_LT" : "Raman Analisis of Lucio Fontana's Inks",
      "card_ml" : "Radar Data Classification with Machine Learning",
      "resources_title": "Materials for Students",
      "resources_description": "Currently, the student handouts and simulations are available on the previous version of the website."
    },
    "projects": {
      "projects_title": "My Projects",
      "university_projects": "University Projects",
      "view_presentation": "Download presentation",
      "view_pdf": "Download PDF",
      "old_site_view": "Go to the previous version of the website",
      "thesis_section": "Thesis projects",
      "exams_section": "Exams projects",
      "other_section": "Other Projects",
      "school_section": "School Presentations",

      "fake_news_title": "Fake News",
      "fake_news_desc": "A civic education activity focused on fake news, including a class-ready exercise.",

      "color_title" : "Color Theory",
      "color_desc" : "A physics-based lesson on color perception, including links to supporting simulations.",

      "tdad_title": "CCD Simulation with Arduino",
      "tdad_desc": "Simulation of data acquisition from a Arduino simulated Raman spectrometer using C++, and Bash. The goal was to create a real-time pipeline for data collection, organization, and analysis from an electronic device.",

      "thesis_bachelor_title": "Bachelor Thesis - Raman Analysis of Lucio Fontana's inks",
      "thesis_bachelor_desc": "Spectroscopic analysis of the inks used by Lucio Fontana in his artworks, using Raman techniques. The project highlights a multidisciplinary approach to physical analysis through a concrete case study.",

      "energy_title": "Solar and Photovoltaic Energy",
      "energy_desc": "An overview of photovoltaic energy: current state, challenges, and research directions. The project summarizes insights from multiple scientific papers.",

      "ml_title": "Radar Classification with ML",
      "ml_desc": "Application of data analysis and machine learning to classify ionospheric radar signals. The project includes a statistical comparison of different models to identify the most effective approach.",

      "thesis_master_title": "Master Thesis - Hyperspectral Phasors Analysis",
      "thesis_master_desc": "Phasor-based analysis of hyperspectral images for early detection of plant diseases. The project explores the full workflow from data collection to AI-based classification.",

      "old_site_title": "My old website",
      "old_site_desc": "More projects—including teaching materials and personal content—are available on my older, less formal website."

    },
    "resources": {
      "title": "Teaching Materials",
      "resource1_title": "Resources for Students",
      "resource2_title": "Simulations for Students",
      "resource1_desc": "Currently not available on this version of the site. You can still access them through the",
      "resources_old_site": "Old version of the website"
    },
    "personal": {
      "page_title": "Personal | Will",
      "title": "About Me",
      "bio_title_ed": "Education",
      "bio_title_now": "Current Position",
      "bio_title_myself": "A brief description",
      "bio_text": "I’m a high school teacher in Mathematics and Physics, with a passion for programming, photography, and science communication.",
      "bio_education" : "I hold a Master's degree in Condensed Matter Physics from the University of Milano-Bicocca. During my academic path, I explored applications of physics across disciplines—from energy to art. I also gained foundational skills in data analysis, machine learning, and numerical simulation.",
      "bio_now": "I currently teach Mathematics and Physics at Liceo Ginnasio Statale B. Cairoli in Vigevano. This role has helped me develop skills in communication, collaboration, and classroom organization.",
      "bio_myself" : "I am motivated by continuous learning and have a keen interest in the EdTech, energy, and and data-driven solutions. I’m available for both national and international opportunities."
    }
  }
}
